{
  "Искуственная нейронная сеть" : "Упрощенная модель биологической нейронной сети, представляющая собой совокупность искусственных нейронов, взаимодействующих между собой.",
  "Рекомендательная система": "Программа (веб-сервис), которая пытается предсказать, какие объекты (фильмы, музыка, книги, новости, веб-сайты) будут интересны пользователю, имея определенную информацию о его профиле.",
  "Колаборативная фильтрация": "Один из методов построения прогнозов (рекомендаций) в рекомендательных системах, использующий известные предпочтения (оценки) группы пользователей для прогнозирования неизвестных предпочтений другого пользователя.",
  "Задача классификациии" : "Задача, в которой имеется множество объектов (ситуаций), разделённых, некоторым образом, на классы.",
  "Машинное обучение": "Класс методов искусственного интеллекта, характерной чертой которых является не прямое решение задачи, а обучение за счёт применения решений множества сходных задач.",
  "Модель машинного обучения": "Файл, который обучен распознаванию определенных типов закономерностей.",
  "Контентная фильтрация": "Система рекомендаций, основанная на фильтрации на основе контента, предоставляет рекомендации пользователю путем анализа описания контента, которое было оценено пользователем.",
  "Фильтрация, основанная на знаниях": "Система рекомендаций, основанная на экспертном мнении. В отличие от контентной и колаборативной фильтрации является неперсонализированной. ",
  "Обучение с учителем": "это тип МО, при котором модель обучается на основе маркированных данных, где каждый пример данных имеет соответствующую целевую переменную или метку.",
  "Обучение без учителя": "это тип МО, при котором модель обучается на немаркированных данных без явной целевой переменной.",
  "Глубокое обучение": "является подразделом МО, который использует искусственные нейронные сети с большим числом слоев для извлечения высокоуровневых признаков из данных. Оно обычно применяется к задачам, таким как распознавание образов, обработка естественного языка и автоматическое принятие решений.",
  "Холодный старт": "ситуация, когда ещё не накоплено достаточное количество данных для корректной работы рекомендательной системы."
}

